In [5]:
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns
%matplotlib inline

### Dataframe from dict

In [7]:
data = {'Name': ['John', 'Sunny', 'Koel', 'Veer'],
        'Age': [30, 28, 19, 27],
        'Courses': ['Python', 'Java', 'C++', 'C']}

df1 = pd.DataFrame.from_dict(data)
df1

    Name  Age Courses
0   John   30  Python
1  Sunny   28    Java
2   Koel   19     C++
3   Veer   27       C

In [8]:
df1.to_csv("data.csv", index=False)

### Dataframe from csv

In [25]:
df2 = pd.read_csv("data.csv")
df2

    Name  Age Courses
0   John   30  Python
1  Sunny   28    Java
2   Koel   19     C++
3   Veer   27       C

### Select cell value by row and column

In [26]:
df2.loc[1, 'Courses']

'Java'

### Replace value

In [27]:
df2.loc[1, 'Courses'] = "Rust"
df2

    Name  Age Courses
0   John   30  Python
1  Sunny   28    Rust
2   Koel   19     C++
3   Veer   27       C

### Concat 2 dataframes

In [22]:
df3 = pd.concat([df1, df2.reindex(df1.index)], axis=0)
df3

    Name  Age Courses
0   John   30  Python
1  Sunny   28    Java
2   Koel   19     C++
3   Veer   27       C
0   John   30  Python
1  Sunny   28    Rust
2   Koel   19     C++
3   Veer   27       C

In [23]:
df4 = pd.concat([df1, df2.reindex(df1.index)], axis=1)
df4

    Name  Age Courses   Name  Age Courses
0   John   30  Python   John   30  Python
1  Sunny   28    Java  Sunny   28    Rust
2   Koel   19     C++   Koel   19     C++
3   Veer   27       C   Veer   27       C